# Поміняти місцями значення змінних a та b для наступних випадків
# a) За допомогою третьої проміжної змінної c. Типи значень змінних можуть бути будь-якими.
# b) Без проміжних змінних, можна використовувати лише змінні a та b. Типи значень змінних можуть бути будь-якими.
# c) Типи значень в змінних a та b можуть бути лише цілими числами. Поміняйте значення змінних використовуючи лише арифметичні операції '+' та '-'
# Не можна використовувати списків, рядків, інших колекцій. В файлі має бути не більше трьох змінних a, b та c.

def task1a():
    a = 1
    b = 2
    c = 0
    c = a
    a = b
    b = c
    print("a =", a, "b =", b)

task1a()

def task1b():
    a = 1
    b = 2
    a, b = b, a
    print("a =", a, "b =", b)

task1b()


def task1c():
    a = 1
    b = 2
    a = a + b
    b = a - b
    a = a - b
    print("a =", a, "b =", b)

task1c()
