"""
Розширити функцію copydeep() з попереднього домашнього завдання, щоб вона також правильно копіювала dict.

Не можна використовувати deepcopy з модулю copy
Вважати, що можливі лише ці типи об'єктів та іхніх можливих вкладених елементів, які можуть бути передані у функцію: str, int, float, bool, list, tuple, dict
Для спрощення завдання вважати, що вхідні колекції (tuple, list, dict) не матимуть рекурсивних елементів, тобто не міститимуть самі себе на будь-якій глибині.
Якщо редагується будь-яка частина чи вкладений на довільній глибині елемент оригінального списку, то в копії не має нічого змінюватися.
"""