"""
Написати функцію, що знаходить різницю між максимальним та мінімальним значенням з num_limit випадкових чисел згенерованих в заданому діапазоні lower_bound..upper_bound.
Для генерації чисел використайте модуль random (можна використати будь-яку зі зручних для вас функцій модулю, наприклад randint).
Для визначення мінімального та максимального значення використайте вбудовані функції min(), max().

def diff_min_max(num_limit, lower_bound, upper_bound): # returns int
    pass

    Виконайте попереднє завдання, але без використання вбудованих функцій min(), max().
"""