"""
Напишіть програму, що запитує у користувача довільний рядок через input(), та для даного рядка виконує наступне:
виведить третій символ цього рядка.
виведить передостанній символ цього рядка.
виведить перші п'ять символів цього рядка.
виведить весь рядок, крім двох останніх символів.
виведить усі символи з парними індексами (вважаючи, що індексація починається з 0, тому символи виводяться починаючи з першого).
виведить усі символи з непарними індексами, тобто, починаючи з другого символу рядка.
виведить усі символи у зворотному порядку.
виведить усі символи рядка через один у зворотному порядку, починаючи з останнього.
виведить довжину цього рядка.
Оформіть вивід кожного підпункту, щоб було зрозуміло, що саме виводиться. Тобто перед виводом результату треба ще вивести текст пояснення, що це.
"""

a = input('довільний рядок : ')

print('третій символ цього рядка: ', a[2])
print('передостанній символ цього рядка: ', a[-2])
print("перші п'ять символів цього рядка: ", a[:5])
print('весь рядок, крім двох останніх символів: ', a[:len(a) - 2])
print('усі символи з парними індексами', a[::2])
print('усі символи з непарними індексами', a[1::2])
print('усі символи у зворотному порядку', a[::-1])
tmp = a[::-1]
print('усі символи рядка через один у зворотному порядку, починаючи з останнього.', tmp[::2])
print('довжину цього рядка: ', len(a))
