"""
Дано список з чисел та рядків. Рядки у списку завжди непорожні та складаються тільки з символів 0123456789.
За допомогою функції sorted() отримати копію цього списку.
Тип оригінальних елементів не має бути змінено, тобто числа мають лишитися числами, рядки -- рядками.

a) Копія має бути відсортована за значенням числа елементу. Наприклад:

# original list
[5, '9', 0, '452', 6.5, '6', 1, 2]
# sorted list
[0, 1, 2, 5, '6', 6.5, '9', '452']
б) Копія має бути відсортована за значенням ПЕРШОЇ цифри числа.
Наприклад (в прикладі немає помилки, відсортовано правильно, за першою цифрою):

# original list
[472, 326, 1, 999.0, '1101000', '99', 9, '20', 863, '0']
# sorted list
['0', 1, '1101000', '20', 326, 472, 863, 999.0, '99', 9]
"""


def list_sort(lst):  # returns integer or None

    return sorted([int(s) for s in lst]) or None


def main():
    list = [5, '9', 0, '452', 6.5, '6', 1, 2]
    print(list_sort(list))


if __name__ == '__main__':
    main()
