"""
Створити функцію "генератор паролів", що повертає згенеровані паролі сумісні з наступними вимогами.
Можна використовувати лише криптостійкі функції для генерації паролю. Вимоги:

Пароль складається мінімум з 8 символів, потрібну довжину приймати параметром, але не менше 8
В паролі допускаються лише великі та маленькі латинські літери, цифри та символ підкреслення "_".
Використайте змінні з модулю string (UKR)
Пароль обов'язково має містити щонайменше одну велику літеру, одну маленьку літеру та одну цифру
Не повинно бути більше 2 однакових символів підряд
"""