"""
Розширити розв'язок задачі 5 з домашки 7:

Програма випадковим чином обирає число від 1 до 10 і пропонує користувачу його вгадати.
Користувач вводить число, а програма перевіряє його і, якщо користувач не вгадав, то програма повідомляє, що введене число більше або менше від згенерованого.
Після цього знову просить вгадати. І так, поки користувач не вгадає.

Щоб згенерувати випрадкове число, скористайтеся функцією randint з модулю random.

Нові умови до завдання:

Програма пропонує дві гри на вибір: або вгадує користувач, або програма.
При цьому варіанті, коли вгадує програма, то вона пропонує число, а користувач повідомляє чи це правильне число, або чи воно більше чи менше за правильне.
В обох варіантах гри число загадується в проміжку від 1 до 100
Після однієї гри, програма пропонує повторити питаючи про це.
Якщо користувач відповів негативно: завершити роботу.
У варіанті гри, коли вгадує програма, для вгадування, програма може використати звичайні випадкові числа від random.randint (але гра буде довгою).
Але краще застосувати Двійковий пошук: відео з поясненням, вікіпедія
Ввід від користувача оформити функціями get_integer, get_str, що побудовані з врахуванням практик, описаних на лекції.
"""